In [48]:
import pandas as pd
data=pd.read_csv('Test.csv')

In [49]:
df=data.copy()

In [21]:
df.head(2)

   S.No.    Name  Class  Roll
0      1  Nikhil      9    50
1      2     Abc      9    49

In [22]:
df.columns

Index(['S.No.', 'Name', 'Class', 'Roll'], dtype='object')

In [23]:
df.shape

(4, 4)

In [24]:
df.dtypes

S.No.     int64
Name     object
Class     int64
Roll      int64
dtype: object

In [25]:
df.describe()

          S.No.  Class       Roll
count  4.000000    4.0   4.000000
mean   2.500000    9.0  51.000000
std    1.290994    0.0   4.830459
min    1.000000    9.0  47.000000
25%    1.750000    9.0  48.500000
50%    2.500000    9.0  49.500000
75%    3.250000    9.0  52.000000
max    4.000000    9.0  58.000000

In [26]:
df.Roll

0    50
1    49
2    58
3    47
Name: Roll, dtype: int64

In [27]:
df.isnull().sum()

S.No.    0
Name     0
Class    0
Roll     0
dtype: int64

In [29]:
df.iloc[0:3,0:2]

   S.No.    Name
0      1  Nikhil
1      2     Abc
2      3     Def

In [44]:

print(df.index)
df.index[0]

df

RangeIndex(start=1, stop=4, step=1)

   S.No. Name  Class  Roll
1      2  Abc      9    49
2      3  Def      9    58
3      4  Ghi      9    47

In [50]:
df.reset_index(drop=True)
#df.drop('S.No.',axis=1)
#df["diff"]=df["sl"]-df["pw"]

   S.No.    Name  Class  Roll
0      1  Nikhil      9    50
1      2     Abc      9    49
2      3     Def      9    58
3      4     Ghi      9    47